tap "homebrew/cask"

brew "aws-shell"
brew "awscli"
brew "bash-completion"
brew "bash"
brew "bat"
brew "coreutils"
brew "docker-completion"
brew "eksctl"
brew "findutils", args: ["with-default-names"]
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "go"
brew "grep", args: ["with-default-names"]
brew "helm"
brew "helmfile"
brew "httpie"
brew "jq"
brew "kind"
brew "krew"
brew "kubernetes-cli"
brew "netcat"
brew "pyenv-virtualenv"
brew "pyenv"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tig"
brew "tree"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wget"

cask "authy"
cask "docker"
cask "dropbox"
cask "firefox"
cask "iterm2"
cask "keepassx"
cask "multipass"
cask "sourcetree"
cask "tableplus"
cask "vagrant"
cask "visual-studio-code"
