tap "homebrew/cask"

# core

brew "ca-certificates"
brew "coreutils"
brew "diffutils"
brew "dua-cli"
brew "findutils", args: ["with-default-names"]
brew "fzf"
brew "gawk", args: ["with-default-names"]
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]
brew "tree"
brew "watch"

# shell

brew "bash-completion"
brew "bash"
brew "shellcheck"
brew "starship"
brew "zsh"

# network

brew "httpie"
brew "netcat"
brew "nmap"
brew "telnet"
brew "wget"

# containers / kubernetes

# brew "argocd"
# brew "crane"
brew "docker-completion"
# brew "faas-cli"
brew "helm"
brew "helmfile"
# brew "istioctl"
brew "k9s"
brew "kind"
# brew "kops"
brew "krew"
brew "kubernetes-cli"
brew "stern"
brew "vcluster"
cask "docker"

# cloud

# brew "aws-iam-authenticator"
brew "awscli"
# brew "azure-cli"

# programming

brew "go"
# brew "maven"
# brew "node"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python"
# brew "ruby"
brew "vim"
# cask "java"

# infra

brew "terraform"
# brew "vagrant-completion"
# cask "multipass"
# cask "vagrant"

# other

cask "dropbox"
cask "firefox"
cask "iterm2"
cask "keepassxc"
cask "sourcetree"
cask "tableplus"
cask "visual-studio-code"
