# taps

tap "hashicorp/tap"
tap "helmwave/tap"

# scm

brew "git"
# brew "jfrog-cli"
cask "sourcetree"

# shell

# brew "bash"
# brew "bash-completion"
brew "starship"
brew "zsh"
cask "iterm2"

# core

brew "ca-certificates"
brew "coreutils"
brew "diffutils"
brew "dua-cli"
brew "findutils", args: ["with-default-names"]
brew "fzf"
brew "gawk", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]
brew "jq"
brew "watch"
brew "yq"

# network

brew "httpie"
brew "netcat"
brew "nmap"
brew "telnet"
brew "wget"

# hashicorp utils

brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"

# cloud

brew "awscli"

# containers and kubernetes

# brew "argocd"
# brew "crane"
cask "docker"
brew "docker-completion"
brew "helm"
brew "helmfile"
brew "helmwave"
# brew "istioctl"
brew "k9s"
# brew "kind"
brew "krew"
brew "kubectx"
brew "kubernetes-cli"
# brew "vcluster"

# languages

# brew "go"
# brew "gomplate"
# brew "openjdk@17", link: true
brew "pyenv"
brew "python"

# vms

# brew "hashicorp/tap/hashicorp-vagrant"
# cask "multipass"
# cask "virtualbox"

# db

# cask "tableplus"

# browsers

cask "firefox"
# cask "google-chrome"

# editors

# brew "vim"
cask "visual-studio-code"

# chat

# cask "webex-teams"
# cask "zoomus"
